[
  {
    "title": "Law and policy",
    "url": "https://www.ilo.org/coop-sse-law-policy",
    "summary": "Law and policy\nomeira@ilo.org\nSun, 08/24/2025 - 13:11\n\n\n\n\nThe International Labour Organization supports the establishment of a conducive environment consistent with the nature and diversity of the social and solidarity economy to promote decent work and harness the fullest potential of social and solidarity economy entities, to contribute to sustainable development and sustainable enterprises, in line with international labour standards, particularly the Promotion of Cooperatives Recommendation, 2002 (No. 193).\n\n\n\n\n\n\n\n\n\n\nThe story of the ILO’s Promotion of Cooperatives Recommendation, 2002 (No. 193)\n\n\n\n\n\n\n\n\n\n\nThe story of the ILO’s Promotion of Cooperatives Recommendation, 2002 (No. 193)\n27 May 2015\n\n\n\n\n\n\n\nPromoting cooperatives: An information guide to ILO Recommendation No. 193\n\n\n\n\n\n\n\n\n\n\nPromoting cooperatives: An information guide to ILO Recommendation No. 193\n6 October 2014\n\n\n\n\n\n\n\nGuidelines for cooperative legislation, third revised edition\n\n\n\n\n\n\n\n\n\n\nGuidelines for cooperative le",
    "published": "Sun, 24 Aug 2025 13:11:28 +0000",
    "feed": "https://ilo.org/rss.xml",
    "domain": "ilo.org",
    "text": "Law and policy omeira@ilo.org Sun, 08/24/2025 - 13:11 The International Labour Organization supports the establishment of a conducive environment consistent with the nature and diversity of the social and solidarity economy to promote decent work and harness the fullest potential of social and solidarity economy entities, to contribute to sustainable development and sustainable enterprises, in line with international labour standards, particularly the Promotion of Cooperatives Recommendation, 2002 (No. 193). The story of the ILO’s Promotion of Cooperatives Recommendation, 2002 (No. 193) The story of the ILO’s Promotion of Cooperatives Recommendation, 2002 (No. 193) 27 May 2015 Promoting cooperatives: An information guide to ILO Recommendation No. 193 Promoting cooperatives: An information guide to ILO Recommendation No. 193 6 October 2014 Guidelines for cooperative legislation, third revised edition Guidelines for cooperative le",
    "score": 0.22073397040367126,
    "cluster_size": 1
  },
  {
    "title": "Estonia ratifies the 1986 Instrument of Amendment to the ILO Constitution",
    "url": "https://www.ilo.org/resource/news/estonia-ratifies-1986-instrument-amendment-ilo-constitution",
    "summary": "Estonia ratifies the 1986 Instrument of Amendment to the ILO Constitution\npapadhopulli@i…\nFri, 08/22/2025 - 15:41\n\n\nDocument Type\nNews\n\n\nDate of Publication\nFri, 08/22/2025 - 12:00\n\n\n\nBrief description\nOn 22 August 2025, the Director-General registered the ratification by Estonia of the 1986 Instrument\nof Amendment to the ILO Constitution.\n\n\n\n\nTo date, the 1986 Amendment has been ratified by 128 Member States, including two Members of chief industrial importance (India and Italy). To enter into force, the 1986 Amendment must be ratified or accepted by two-thirds of ILO Member States, including at least five of the 10 Members of chief industrial importance. Therefore, three more ratifications from Members of chief industrial importance (from among Brazil, China, France, Germany, Japan, the Russian Federation, United Kingdom and United States) are needed for the amendment to take effect. For more information, see Questions and answers about the 1986 Instrument of Amendment to the ILO Con",
    "published": "Fri, 22 Aug 2025 15:41:01 +0000",
    "feed": "https://ilo.org/rss.xml",
    "domain": "ilo.org",
    "text": "Estonia ratifies the 1986 Instrument of Amendment to the ILO Constitution papadhopulli@i… Fri, 08/22/2025 - 15:41 Document Type News Date of Publication Fri, 08/22/2025 - 12:00 Brief description On 22 August 2025, the Director-General registered the ratification by Estonia of the 1986 Instrument of Amendment to the ILO Constitution. To date, the 1986 Amendment has been ratified by 128 Member States, including two Members of chief industrial importance (India and Italy). To enter into force, the 1986 Amendment must be ratified or accepted by two-thirds of ILO Member States, including at least five of the 10 Members of chief industrial importance. Therefore, three more ratifications from Members of chief industrial importance (from among Brazil, China, France, Germany, Japan, the Russian Federation, United Kingdom and United States) are needed for the amendment to take effect. For more information, see Questions and answers about the 1986 Instrument of Amendment to the ILO Con",
    "score": 0.2409251481294632,
    "cluster_size": 1
  },
  {
    "title": "Common Challenges Organizations Face With AI Adoption—and How to Overcome Them",
    "url": "https://www.mbopartners.com/blog/independent-workforce-trends/common-challenges-organizations-face-when-implementing-ai-and-how-to-overcome-them/",
    "summary": "AI is the newest technology changing how companies work, offering exciting opportunities for those who work with independent contractors. As highlighted in our recent research on AI usage in MBO’s State of Independence report, many independents are eager to take their work to the next level and achieve more meaningful results with AI. 65% of independents…\nThe post Common Challenges Organizations Face With AI Adoption—and How to Overcome Them appeared first on MBO Partners.",
    "published": "Mon, 25 Aug 2025 09:00:52 +0000",
    "feed": "https://mbopartners.com/feed",
    "domain": "mbopartners.com",
    "text": "AI is the newest technology changing how companies work, offering exciting opportunities for those who work with independent contractors. As highlighted in our recent research on AI usage in MBO’s State of Independence report, many independents are eager to take their work to the next level and achieve more meaningful results with AI. 65% of independents… The post Common Challenges Organizations Face With AI Adoption—and How to Overcome Them appeared first on MBO Partners.",
    "score": 0.26845526695251465,
    "cluster_size": 2
  },
  {
    "title": "How Are Independent Professionals Using AI to Get Ahead?",
    "url": "https://www.mbopartners.com/blog/how-grow-small-business/5-ways-to-use-generative-ai-for-your-small-business/",
    "summary": "The independent workforce is changing fast—and AI is right at the center of that shift. In our latest State of Independence report due out Sept. 8, we found that professionals across industries are using AI to work smarter, move faster, and boost their creativity.   These professionals not just trying out new tools—they’re weaving them…\nThe post How Are Independent Professionals Using AI to Get Ahead? appeared first on MBO Partners.",
    "published": "Wed, 20 Aug 2025 09:00:12 +0000",
    "feed": "https://mbopartners.com/feed",
    "domain": "mbopartners.com",
    "text": "The independent workforce is changing fast—and AI is right at the center of that shift. In our latest State of Independence report due out Sept. 8, we found that professionals across industries are using AI to work smarter, move faster, and boost their creativity. These professionals not just trying out new tools—they’re weaving them… The post How Are Independent Professionals Using AI to Get Ahead? appeared first on MBO Partners.",
    "score": 0.25190839171409607,
    "cluster_size": 2
  },
  {
    "title": "Why Independent Professionals Are Leading the Way in AI Adoption",
    "url": "https://www.mbopartners.com/blog/independent-workforce-trends/why-independent-contractors-are-leading-ai-adoption/",
    "summary": "While your organization may still be navigating complex approval processes and company-wide AI rollouts, independent professionals are already embracing AI faster—and often more effectively—than traditional employees. The data tells a clear story. Here’s just a teaser of what you’ll see when our latest State of Independence report is published on Monday, Sept. 8. In 2025,…\nThe post Why Independent Professionals Are Leading the Way in AI Adoption appeared first on MBO Partners.",
    "published": "Tue, 19 Aug 2025 09:00:10 +0000",
    "feed": "https://mbopartners.com/feed",
    "domain": "mbopartners.com",
    "text": "While your organization may still be navigating complex approval processes and company-wide AI rollouts, independent professionals are already embracing AI faster—and often more effectively—than traditional employees. The data tells a clear story. Here’s just a teaser of what you’ll see when our latest State of Independence report is published on Monday, Sept. 8. In 2025,… The post Why Independent Professionals Are Leading the Way in AI Adoption appeared first on MBO Partners.",
    "score": 0.26687732338905334
  },
  {
    "title": "Dear SaaStr: How Do I Structure a Comp Package for Our First VP of Sales?",
    "url": "https://www.saastr.com/dear-saastr-how-do-i-structure-a-comp-package-for-our-first-vp-of-sales/",
    "summary": "Dear SaaStr: How Do I Structure a Comp Package for Our First VP of Sales?  He’ll have 7 folks under him, For a small SaaS company with a Head of Sales managing 7 FTEs, I’d recommend a compensation structure that aligns with both early-stage SaaS norms and your growth goals. Here’s how I’d approach it:... Continue Reading",
    "published": "Mon, 25 Aug 2025 09:07:27 +0000",
    "feed": "https://saastr.com/feed",
    "domain": "saastr.com",
    "text": "Dear SaaStr: How Do I Structure a Comp Package for Our First VP of Sales? He’ll have 7 folks under him, For a small SaaS company with a Head of Sales managing 7 FTEs, I’d recommend a compensation structure that aligns with both early-stage SaaS norms and your growth goals. Here’s how I’d approach it:... Continue Reading",
    "score": 0.2255174070596695,
    "cluster_size": 1
  },
  {
    "title": "Dear SaaStr: What Are Signs It’s Finally Time to Move on From An Employee?",
    "url": "https://www.saastr.com/dear-saastr-what-are-signs-its-finally-time-to-move-on-from-an-employee/",
    "summary": "Dear SaaStr: What Are Signs It’s Finally Time to Move on From An Employee? \"When you make a bad VP hire, it's always your fault as CEO, not theirs. The candidate can never do enough research to understand if it's really the right fit.\" @kippbodnar @searchbrat @jasonlk pic.twitter.com/xkgJtznHDz — Jason ✨👾SaaStr.Ai✨ Lemkin (@jasonlk) April 21,... Continue Reading",
    "published": "Sat, 23 Aug 2025 09:29:15 +0000",
    "feed": "https://saastr.com/feed",
    "domain": "saastr.com",
    "text": "Dear SaaStr: What Are Signs It’s Finally Time to Move on From An Employee? \"When you make a bad VP hire, it's always your fault as CEO, not theirs. The candidate can never do enough research to understand if it's really the right fit.\" @kippbodnar @searchbrat @jasonlk pic.twitter.com/xkgJtznHDz — Jason ✨👾SaaStr.Ai✨ Lemkin (@jasonlk) April 21,... Continue Reading",
    "score": 0.24431279301643372,
    "cluster_size": 1
  }
]