[
  {
    "title": "7 Tips on Encouraging Your Workforce to Use AI",
    "url": "https://www.mbopartners.com/blog/workforce-management/7-tips-on-encouraging-your-workforce-to-use-gen-ai/",
    "summary": "Improving AI skills is a growing priority for independent contractors, with 74% saying that ongoing AI training is important, according to MBO’s latest State of Independence report. As companies use advanced technologies like AI to boost productivity and spark innovation, it’s essential to keep your team engaged and excited about the possibilities. Introducing AI tools…\nThe post 7 Tips on Encouraging Your Workforce to Use AI appeared first on MBO Partners.",
    "published": "Wed, 27 Aug 2025 09:00:29 +0000",
    "feed": "https://mbopartners.com/feed",
    "domain": "mbopartners.com",
    "text": "Improving AI skills is a growing priority for independent contractors, with 74% saying that ongoing AI training is important, according to MBO’s latest State of Independence report. As companies use advanced technologies like AI to boost productivity and spark innovation, it’s essential to keep your team engaged and excited about the possibilities. Introducing AI tools… The post 7 Tips on Encouraging Your Workforce to Use AI appeared first on MBO Partners.",
    "score": 0.2650115489959717,
    "cluster_size": 1
  },
  {
    "title": "Agent of Record (AOR) Guide: Setting the Foundation for a Stronger Workforce",
    "url": "https://www.mbopartners.com/blog/guide/agent-of-record-ungated/",
    "summary": "Struggling to manage independent contractors while staying compliant? Learn how an Agent of Record (AOR) can streamline contractor engagement, reduce risk, and support a smarter workforce strategy.\nThe post Agent of Record (AOR) Guide: Setting the Foundation for a Stronger Workforce appeared first on MBO Partners.",
    "published": "Tue, 26 Aug 2025 06:09:29 +0000",
    "feed": "https://mbopartners.com/feed",
    "domain": "mbopartners.com",
    "text": "Struggling to manage independent contractors while staying compliant? Learn how an Agent of Record (AOR) can streamline contractor engagement, reduce risk, and support a smarter workforce strategy. The post Agent of Record (AOR) Guide: Setting the Foundation for a Stronger Workforce appeared first on MBO Partners.",
    "score": 0.2834257483482361,
    "cluster_size": 1
  },
  {
    "title": "When We All Have 100 Paid AI Agents, What Happens Next? Conslidation. It’s Coming.",
    "url": "https://www.saastr.com/when-we-all-have-100-ai-agents-what-happens-next-conslidation-its-coming/",
    "summary": "Right now, AI is in its pure growth area. Every CIO is deploying more budget to AI solutions in a drive for efficiency and to keep up with the competition. But even if IT budgets continue to grow at their current epic rate, the pace of applications we are buying just can’t last.  And that... Continue Reading",
    "published": "Thu, 28 Aug 2025 14:10:11 +0000",
    "feed": "https://saastr.com/feed",
    "domain": "saastr.com",
    "text": "Right now, AI is in its pure growth area. Every CIO is deploying more budget to AI solutions in a drive for efficiency and to keep up with the competition. But even if IT budgets continue to grow at their current epic rate, the pace of applications we are buying just can’t last. And that... Continue Reading",
    "score": 0.2722872793674469,
    "cluster_size": 1
  }
]